src/cf/Enums/ИПТарифыФиксированныхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИПТарифыФиксированныхВзносов</Name>
			<Comment>Тарифы фиксированных взносов ИП согласно ст. 430 НК РФ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единый</Name>
					<Comment>Единый тариф согласно п.1.2 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйПенсионер</Name>
					<Comment>Тариф для военных пенсионеров согласно п.1.4. ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСЭЗнаНТ</Name>
					<Comment>Тариф для участника СЭЗ в соответствии с п.1.3 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ИПТарифыФиксированныхВзносов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	ДанныеВыбора = Новый СписокЗначений;
	// п.1.2 ст.430 НК РФ
	ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.Единый);
	
	Если РегламентированнаяОтчетностьУСНВызовСервера.ДоступенТарифДляВоенныхПенсионеров(ТекущаяДата) Тогда
		// п.1.4 ст.430 НК РФ
		ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.ВоенныйПенсионер);
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьУСНВызовСервера.ПрименяетсяТарифУчастникСЭЗ(ТекущаяДата)
		И ИнтеграцияСБанкамиПовтИсп.ИнтеграцияВИнформационнойБазеВключена() Тогда
		// п.1.3 ст.430 НК РФ
		ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.УчастникСЭЗнаНТ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
